// Соответствия URL и новых заголовков h1, title, description и rel="canonical"
var pageData = {
  "https://newbornk.com/collections/women/%D0%9B%D0%B5%D0%B3%D1%96%D0%BD%D1%81%D0%B8": {
    h1: "жіночі леггінсі",
    title: "Купити жіночі леггінсі в Україні: кращі дизайнери | NEWBORN K",
    description: "жіночі леггінсі за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%9B%D0%B5%D0%B3%D1%96%D0%BD%D1%81%D0%B8" // Замените на нужный URL
  },
  "https://newbornk.com/collections/men/%D0%A8%D0%BE%D1%80%D1%82%D0%B8": {
    h1: "чоловічі шорти",
    title: "Купити чоловічі шорті в Україні: кращі дизайнери | NEWBORN K",
    description: "чоловічі шорти за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A8%D0%BE%D1%80%D1%82%D0%B8" // Замените на нужный URL
  },
"https://newbornk.com/collections/men/%D0%91%D1%96%D0%BB%D0%B8%D0%B7%D0%BD%D0%B0": {
    h1: "чоловіча білизна",
    title: "чоловіча білизна в Україні: кращі дизайнери | NEWBORN K",
    description: "чоловіча білизна за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%91%D1%96%D0%BB%D0%B8%D0%B7%D0%BD%D0%B0" // Замените на нужный URL
  },
 "https://newbornk.com/collections/men/%D0%90%D0%BA%D1%81%D0%B5%D1%81%D1%83%D0%B0%D1%80%D0%B8": {
    h1: "чоловічи аксесуари",
    title: "чоловічи аксесуари, купити дизайнерські аксесуари для чоловіків в Україні | NEWBORN K",
    description: "чоловічи аксесуари за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%90%D0%BA%D1%81%D0%B5%D1%81%D1%83%D0%B0%D1%80%D0%B8" // Замените на нужный URL
  }, 
 "https://newbornk.com/collections/men/%D0%A4%D1%83%D1%82%D0%B1%D0%BE%D0%BB%D0%BA%D0%B8": {
    h1: "чоловічи футболки",
    title: "чоловічи футболки, купити дизайнерські футболки для чоловіків в Україні | NEWBORN K",
    description: "чоловічи футболки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A4%D1%83%D1%82%D0%B1%D0%BE%D0%BB%D0%BA%D0%B8" // Замените на нужный URL
  }, 
  "https://newbornk.com/collections/men/%D0%A8%D1%82%D0%B0%D0%BD%D0%B8": {
    h1: "чоловічи штани",
    title: "чоловічи штани, купити дизайнерські штани для чоловіків в Україні | NEWBORN K",
    description: "чоловічи штани за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A8%D1%82%D0%B0%D0%BD%D0%B8" // Замените на нужный URL
  }, 
   "https://newbornk.com/collections/men/%D0%A5%D1%83%D0%B4%D1%96": {
    h1: "чоловічи худі",
    title: "чоловічи худі, купити дизайнерські худі для чоловіків в Україні | NEWBORN K",
    description: "чоловічи худі за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A5%D1%83%D0%B4%D1%96" // Замените на нужный URL
  }, 
     "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8": {
    h1: "чоловічи сорочки",
    title: "чоловічи сорочки, купити дизайнерські сорочки для чоловіків в Україні | NEWBORN K",
    description: "чоловічи сорочки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8" // Замените на нужный URL
  }, 
       "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8": {
    h1: "чоловічи cвітшоти",
    title: "чоловічи cвітшоти, купити дизайнерські cвітшоти для чоловіків в Україні | NEWBORN K",
    description: "чоловічи cвітшоти за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8" // Замените на нужный URL
  }, 
         "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8": {
    h1: "чоловічи светри",
    title: "чоловічи светри, купити дизайнерські светри для чоловіків в Україні | NEWBORN K",
    description: "чоловічи светри за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8" // Замените на нужный URL
  }, 
           "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8": {
    h1: "чоловічи пальта",
    title: "чоловічи пальта, купити дизайнерські пальта для чоловіків в Україні | NEWBORN K",
    description: "чоловічи пальта за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%BF%D0%B0%D0%BB%D1%8C%D1%82%D0%B0" // Замените на нужный URL
  }, 
           "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8": {
    h1: "чоловічи лонгсліви",
    title: "чоловічи лонгсліви, купити дизайнерські лонгсліви для чоловіків в Україні | NEWBORN K",
    description: "чоловічи лонгсліви за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8" // Замените на нужный URL
  }, 
            "https://newbornk.com/collections/men/%D0%9A%D1%83%D1%80%D1%82%D0%BA%D0%B8": {
    h1: "чоловічи куртки",
    title: "чоловічи куртки, купити дизайнерські куртки для чоловіків в Україні | NEWBORN K",
    description: "чоловічи куртки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%9A%D1%83%D1%80%D1%82%D0%BA%D0%B8" // Замените на нужный URL
  }, 
    "https://newbornk.com/collections/%D0%BA%D0%BE%D0%BC%D0%B1%D1%96%D0%BD%D0%B5%D0%B7%D0%BE%D0%BD%D0%B8/%D0%9A%D0%BE%D0%BC%D0%B1%D1%96%D0%BD%D0%B5%D0%B7%D0%BE%D0%BD%D0%B8": {
    h1: "чоловічи комбінезони",
    title: "чоловічи комбінезони, купити дизайнерські комбінезони для чоловіків в Україні | NEWBORN K",
    description: "чоловічи комбінезони за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/%D0%BA%D0%BE%D0%BC%D0%B1%D1%96%D0%BD%D0%B5%D0%B7%D0%BE%D0%BD%D0%B8/%D0%9A%D0%BE%D0%BC%D0%B1%D1%96%D0%BD%D0%B5%D0%B7%D0%BE%D0%BD%D0%B8" // Замените на нужный URL
  }, 
       "https://newbornk.com/collections/men/%D0%BA%D1%96%D0%BC%D0%BE%D0%BD%D0%BE": {
    h1: "чоловічи кімоно",
    title: "чоловічи кімоно, купити дизайнерські кімоно для чоловіків в Україні | NEWBORN K",
    description: "чоловічи кімоно за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%BA%D1%96%D0%BC%D0%BE%D0%BD%D0%BE" // Замените на нужный URL
  },       
         "https://newbornk.com/collections/men/%D0%96%D0%B8%D0%BB%D0%B5%D1%82%D0%B8": {
    h1: "чоловічи жилети",
    title: "чоловічи жилети, купити дизайнерські жилети для чоловіків в Україні | NEWBORN K",
    description: "чоловічи жилети за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%96%D0%B8%D0%BB%D0%B5%D1%82%D0%B8" // Замените на нужный URL
  },  
          "https://newbornk.com/collections/men/%D0%94%D0%BE%D1%89%D0%BE%D0%B2%D0%B8%D0%BA%D0%B8": {
    h1: "чоловічи дощовики",
    title: "чоловічи дощовики, купити дизайнерські дощовики для чоловіків в Україні | NEWBORN K",
    description: "чоловічи дощовики за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%94%D0%BE%D1%89%D0%BE%D0%B2%D0%B8%D0%BA%D0%B8" // Замените на нужный URL
  },  
            "https://newbornk.com/collections/men/%D0%B4%D0%B5%D0%BD%D1%96%D0%BC": {
    h1: "Брендовий чоловічий денім",
    title: "Брендовий чоловічий денім, купити дизайнерський денім для чоловіків в Україні | NEWBORN K",
    description: "Брендовий чоловічий денім за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%B4%D0%B5%D0%BD%D1%96%D0%BC" // Замените на нужный URL
  },  
            "https://newbornk.com/collections/men/%D0%BF%D0%BE%D0%BB%D0%BE": {
    h1: "чоловічи футболки поло",
    title: "чоловічи футболки поло, купити дизайнерські футболки поло для чоловіків в Україні | NEWBORN K",
    description: "чоловічи футболки поло за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%BF%D0%BE%D0%BB%D0%BE" // Замените на нужный URL
  },  
  
  
  "https://newbornk.com/collections/men": {
    h1: "Брендовий чоловічий одяг",
    title: "Брендовий чоловічий одяг, купити дизайнерський одяг для чоловіків в Україні | NEWBORN K",
    description: "Брендовий чоловічий одяг за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men" // Замените на нужный URL
  },
  
    "https://newbornk.com/collections/women": {
    h1: "Брендовий жіночий одяг",
    title: "Брендовий жіночий одяг, купити дизайнерський одяг для жінок в Україні | NEWBORN K",
    description: "Брендовий жіночий одяг за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women" // Замените на нужный URL
  },
 "https://newbornk.com/collections/women/%D0%91%D1%96%D0%BB%D0%B8%D0%B7%D0%BD%D0%B0": {
    h1: "жіноча білизна",
    title: "жіноча білизна в Україні: кращі дизайнери | NEWBORN K",
    description: "жіноча білизна за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%91%D1%96%D0%BB%D0%B8%D0%B7%D0%BD%D0%B0" // Замените на нужный URL
  }, 
           "https://newbornk.com/collections/men/%D0%94%D0%BE%D1%89%D0%BE%D0%B2%D0%B8%D0%BA%D0%B8": {
    h1: "жіночі дощовики",
    title: "жіночі дощовики, купити дизайнерські дощовики для жінок в Україні | NEWBORN K",
    description: "жіночі дощовики за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%94%D0%BE%D1%89%D0%BE%D0%B2%D0%B8%D0%BA%D0%B8" // Замените на нужный URL
  },  
            "https://newbornk.com/collections/women/%D0%A8%D1%82%D0%B0%D0%BD%D0%B8": {
    h1: "жіночі штани",
    title: "жіночі штани, купити дизайнерські штани для жінок в Україні | NEWBORN K",
    description: "жіночі штани за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A8%D1%82%D0%B0%D0%BD%D0%B8" // Замените на нужный URL
  },  
             "https://newbornk.com/collections/women/%D0%A8%D0%BE%D1%80%D1%82%D0%B8": {
    h1: "жіночі шорти",
    title: "жіночі шорти, купити дизайнерські шорти для жінок в Україні | NEWBORN K",
    description: "жіночі шорти за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A8%D0%BE%D1%80%D1%82%D0%B8" // Замените на нужный URL
  },   
               "https://newbornk.com/collections/women/%D0%A5%D1%83%D0%B4%D1%96": {
    h1: "жіночі худі",
    title: "жіночі худі, купити дизайнерські худі для жінок в Україні | NEWBORN K",
    description: "жіночі худі за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A5%D1%83%D0%B4%D1%96" // Замените на нужный URL
  },  
               "https://newbornk.com/collections/women/%D0%A4%D1%83%D1%82%D0%B1%D0%BE%D0%BB%D0%BA%D0%B8": {
    h1: "жіночі футболки",
    title: "жіночі футболки, купити дизайнерські футболки для жінок в Україні | NEWBORN K",
    description: "жіночі футболки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A4%D1%83%D1%82%D0%B1%D0%BE%D0%BB%D0%BA%D0%B8" // Замените на нужный URL
  },  
               "https://newbornk.com/collections/women/%D0%A2%D0%BE%D0%BF%D0%B8": {
    h1: "жіночі топи",
    title: "жіночі топи, купити дизайнерські топи для жінок в Україні | NEWBORN K",
    description: "жіночі топи за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A2%D0%BE%D0%BF%D0%B8" // Замените на нужный URL
  },     
                "https://newbornk.com/collections/women/%D0%9A%D1%83%D1%80%D1%82%D0%BA%D0%B8+%D0%96%D1%96%D0%BD%D0%BE%D1%87%D0%B5": {
    h1: "жіночі куртки",
    title: "жіночі куртки, купити дизайнерські куртки для жінок в Україні | NEWBORN K",
    description: "жіночі куртки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%9A%D1%83%D1%80%D1%82%D0%BA%D0%B8+%D0%96%D1%96%D0%BD%D0%BE%D1%87%D0%B5" // Замените на нужный URL
  },   
   "https://newbornk.com/collections/women/%D0%BA%D1%96%D0%BC%D0%BE%D0%BD%D0%BE": {
    h1: "жіночі кімоно",
    title: "жіночі кімоно, купити дизайнерські кімоно для жінок в Україні | NEWBORN K",
    description: "жіночі кімоно за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%BA%D1%96%D0%BC%D0%BE%D0%BD%D0%BE" // Замените на нужный URL
  },   
     "https://newbornk.com/collections/women/%D0%96%D0%B8%D0%BB%D0%B5%D1%82%D0%B8": {
    h1: "жіночі жилети",
    title: "жіночі жилети, купити дизайнерські жилети для жінок в Україні | NEWBORN K",
    description: "жіночі жилети за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%96%D0%B8%D0%BB%D0%B5%D1%82%D0%B8" // Замените на нужный URL
  },   
     "https://newbornk.com/collections/women/%D0%A1%D1%83%D0%BA%D0%BD%D1%96": {
    h1: "жіночі сукні",
    title: "жіночі сукні, купити дизайнерські сукні для жінок в Україні | NEWBORN K",
    description: "жіночі сукні за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A1%D1%83%D0%BA%D0%BD%D1%96" // Замените на нужный URL
  },   
       "https://newbornk.com/collections/women/%D0%A1%D1%83%D0%BA%D0%BD%D1%96": {
    h1: "жіночі сорочки",
    title: "жіночі сорочки, купити дизайнерські сорочки для жінок в Україні | NEWBORN K",
    description: "жіночі сорочки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A1%D1%83%D0%BA%D0%BD%D1%96" // Замените на нужный URL
  },
  
         "https://newbornk.com/collections/women/%D0%A1%D0%B2%D1%96%D1%82%D1%88%D0%BE%D1%82%D0%B8": {
    h1: "жіночі cвітшоти",
    title: "жіночі cвітшоти, купити дизайнерські cвітшоти для жінок в Україні | NEWBORN K",
    description: "жіночі cвітшоти за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A1%D0%B2%D1%96%D1%82%D1%88%D0%BE%D1%82%D0%B8" // Замените на нужный URL
  },
           "https://newbornk.com/collections/women/%D0%A1%D0%B2%D0%B5%D1%82%D1%80%D0%B8": {
    h1: "жіночі светри",
    title: "жіночі светри, купити дизайнерські светри для жінок в Україні | NEWBORN K",
    description: "жіночі светри за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A1%D0%B2%D0%B5%D1%82%D1%80%D0%B8" // Замените на нужный URL
  },
            "https://newbornk.com/collections/women/%D0%A1%D0%BF%D1%96%D0%B4%D0%BD%D0%B8%D1%86%D1%96": {
    h1: "жіночі спідниці",
    title: "жіночі спідниці, купити дизайнерські спідниці для жінок в Україні | NEWBORN K",
    description: "жіночі спідниці за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A1%D0%BF%D1%96%D0%B4%D0%BD%D0%B8%D1%86%D1%96" // Замените на нужный URL
  }, 
             "https://newbornk.com/collections/women/%D0%9B%D0%BE%D0%BD%D0%B3%D1%81%D0%BB%D1%96%D0%B2%D0%B8": {
    h1: "жіночі лонгсліви",
    title: "жіночі лонгсліви, купити дизайнерські лонгсліви для жінок в Україні | NEWBORN K",
    description: "жіночі лонгсліви за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%9B%D0%BE%D0%BD%D0%B3%D1%81%D0%BB%D1%96%D0%B2%D0%B8" // Замените на нужный URL
  }, 
              "https://newbornk.com/collections/women/%D0%91%D0%BE%D0%B4%D1%96": {
    h1: "жіночі боді",
    title: "жіночі боді, купити дизайнерські боді для жінок в Україні | NEWBORN K",
    description: "жіночі боді за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%91%D0%BE%D0%B4%D1%96" // Замените на нужный URL
  },   
             "https://newbornk.com/collections/women/%D0%90%D0%BA%D1%81%D0%B5%D1%81%D1%83%D0%B0%D1%80%D0%B8": {
    h1: "жіночі аксесуари",
    title: "жіночі аксесуари, купити дизайнерські аксесуари для жінок в Україні | NEWBORN K",
    description: "жіночі аксесуари за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%90%D0%BA%D1%81%D0%B5%D1%81%D1%83%D0%B0%D1%80%D0%B8" // Замените на нужный URL
  },   
  
  
             "https://newbornk.com/collections/accessoires/%D0%B1%D0%B0%D0%BD%D0%B4%D0%B0%D0%BD%D0%B8": {
    h1: "бандани",
    title: "бандани, купити дизайнерські бандани в Україні | NEWBORN K",
    description: "бандани за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%B1%D0%B0%D0%BD%D0%B4%D0%B0%D0%BD%D0%B8" // Замените на нужный URL
  },  
  
               "https://newbornk.com/collections/accessoires/%D0%91%D0%B0%D0%BB%D0%B0%D0%BA%D0%BB%D0%B0%D0%B2%D0%B8": {
    h1: "балаклави",
    title: "балаклави, купити дизайнерські балаклави в Україні | NEWBORN K",
    description: "балаклави за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%91%D0%B0%D0%BB%D0%B0%D0%BA%D0%BB%D0%B0%D0%B2%D0%B8" // Замените на нужный URL
  },
               "https://newbornk.com/collections/accessoires/%D0%93%D0%B0%D0%BC%D0%B0%D0%BD%D1%86%D1%96": {
    h1: "гаманці",
    title: "гаманці, купити дизайнерські гаманці в Україні | NEWBORN K",
    description: "гаманці за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%93%D0%B0%D0%BC%D0%B0%D0%BD%D1%86%D1%96" // Замените на нужный URL
  },
                 "https://newbornk.com/collections/accessoires/%D0%B3%D0%BE%D0%B4%D0%B8%D0%BD%D0%BD%D0%B8%D0%BA": {
    h1: "годинники",
    title: "годинники, купити дизайнерські годинники в Україні | NEWBORN K",
    description: "годинники за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%B3%D0%BE%D0%B4%D0%B8%D0%BD%D0%BD%D0%B8%D0%BA" // Замените на нужный URL
  },
  "https://newbornk.com/collections/%D0%BC%D0%B0%D1%81%D0%BA%D0%B8/%D0%9C%D0%B0%D1%81%D0%BA%D0%B8": {
    h1: "маски",
    title: "маски, купити дизайнерські маски в Україні | NEWBORN K",
    description: "маски за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/%D0%BC%D0%B0%D1%81%D0%BA%D0%B8/%D0%9C%D0%B0%D1%81%D0%BA%D0%B8" // Замените на нужный URL
  },
  "https://newbornk.com/collections/accessoires/%D0%9A%D0%B5%D0%BF%D0%BA%D0%B8": {
    h1: "кепки",
    title: "кепки, купити дизайнерські кепки в Україні | NEWBORN K",
    description: "кепки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%9A%D0%B5%D0%BF%D0%BA%D0%B8" // Замените на нужный URL
  }, 
  
   "https://newbornk.com/collections/accessoires/%D0%9F%D0%B0%D0%BD%D0%B0%D0%BC%D0%B8": {
    h1: "панами",
    title: "панами, купити дизайнерські панами в Україні | NEWBORN K",
    description: "панами за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%9F%D0%B0%D0%BD%D0%B0%D0%BC%D0%B8" // Замените на нужный URL
  }, 
     "https://newbornk.com/collections/%D0%BE%D1%87%D0%BA%D0%B8/%D0%9E%D0%BA%D1%83%D0%BB%D1%8F%D1%80%D0%B8": {
    h1: "окуляри",
    title: "окуляри, купити дизайнерські окуляри в Україні | NEWBORN K",
    description: "окуляри за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/%D0%BE%D1%87%D0%BA%D0%B8/%D0%9E%D0%BA%D1%83%D0%BB%D1%8F%D1%80%D0%B8" // Замените на нужный URL
  }, 
       "https://newbornk.com/collections/accessoires/%D0%A0%D0%B5%D0%BC%D0%B5%D0%BD%D1%96": {
    h1: "ремені",
    title: "ремені, купити дизайнерські ремені в Україні | NEWBORN K",
    description: "ремені за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A0%D0%B5%D0%BC%D0%B5%D0%BD%D1%96" // Замените на нужный URL
  }, 
        "https://newbornk.com/collections/accessoires/%D0%A0%D1%8E%D0%BA%D0%B7%D0%B0%D0%BA%D0%B8": {
    h1: "рюкзаки",
    title: "рюкзаки, купити дизайнерські рюкзаки в Україні | NEWBORN K",
    description: "рюкзаки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A0%D1%8E%D0%BA%D0%B7%D0%B0%D0%BA%D0%B8" // Замените на нужный URL
  },  
          "https://newbornk.com/collections/accessoires/%D0%A0%D1%83%D0%BA%D0%B0%D0%B2%D0%B8%D1%87%D0%BA%D0%B8": {
    h1: "рукавички",
    title: "рукавички, купити дизайнерські рукавички в Україні | NEWBORN K",
    description: "рукавички за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A0%D1%83%D0%BA%D0%B0%D0%B2%D0%B8%D1%87%D0%BA%D0%B8" // Замените на нужный URL
  },  
           "https://newbornk.com/collections/accessoires/%D0%A1%D1%83%D0%BC%D0%BA%D0%B8": {
    h1: "сумки",
    title: "сумки, купити дизайнерські сумки в Україні | NEWBORN K",
    description: "сумки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A1%D1%83%D0%BC%D0%BA%D0%B8" // Замените на нужный URL
  },   
           "https://newbornk.com/collections/accessoires/%D0%A8%D0%B0%D0%BF%D0%BA%D0%B8": {
    h1: "шапки",
    title: "шапки, купити дизайнерські шапки в Україні | NEWBORN K",
    description: "шапки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A8%D0%B0%D0%BF%D0%BA%D0%B8" // Замените на нужный URL
  },     
           "https://newbornk.com/collections/accessoires/%D0%A8%D0%B0%D1%80%D1%84%D0%B8": {
    h1: "шарфи",
    title: "шарфи, купити дизайнерські шарфи в Україні | NEWBORN K",
    description: "шарфи за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A8%D0%B0%D1%80%D1%84%D0%B8" // Замените на нужный URL
  },    
            "https://newbornk.com/collections/accessoires/%D0%A8%D0%BA%D0%B0%D1%80%D0%BF%D0%B5%D1%82%D0%BA%D0%B8": {
    h1: "шкарпетки",
    title: "шкарпетки, купити дизайнерські шкарпетки в Україні | NEWBORN K",
    description: "шкарпетки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A8%D0%BA%D0%B0%D1%80%D0%BF%D0%B5%D1%82%D0%BA%D0%B8" // Замените на нужный URL
  },    
             "https://newbornk.com/collections/accessoires/%D0%AE%D0%B2%D0%B5%D0%BB%D1%96%D1%80%D0%BA%D0%B0": {
    h1: "ювелірні вироби",
    title: "ювелірні вироби, купити дизайнерські ювелірні вироби в Україні | NEWBORN K",
    description: "ювелірні вироби за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%AE%D0%B2%D0%B5%D0%BB%D1%96%D1%80%D0%BA%D0%B0" // Замените на нужный URL
  }, 
             "https://newbornk.com/collections/lifestyle/%D0%9A%D0%B8%D0%BB%D0%B8%D0%BC%D0%B8": {
    h1: "килими",
    title: "килими, купити дизайнерські килими в Україні | NEWBORN K",
    description: "килими за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/lifestyle/%D0%9A%D0%B8%D0%BB%D0%B8%D0%BC%D0%B8" // Замените на нужный URL
  },  
             "https://newbornk.com/collections/accessoires/%D0%94%D0%BE%D0%B3%D0%BB%D1%8F%D0%B4-%D0%B7%D0%B0-%D0%B2%D0%B7%D1%83%D1%82%D1%82%D1%8F%D0%BC": {
    h1: "Засоби для догляду за взуттям",
    title: "Засоби для догляду за взуттям купити в Україні | NEWBORN K",
    description: "Засоби для догляду за взуттям за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%94%D0%BE%D0%B3%D0%BB%D1%8F%D0%B4-%D0%B7%D0%B0-%D0%B2%D0%B7%D1%83%D1%82%D1%82%D1%8F%D0%BC" // Замените на нужный URL
  },  
             "https://newbornk.com/collections/accessoires/%D0%9A%D0%B0%D0%BF%D0%BE%D1%80": {
    h1: "Дизайнерський капор",
    title: "Брендовий капор, купити дизайнерський капор в Україні | NEWBORN K",
    description: "Брендовий капор за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%9A%D0%B0%D0%BF%D0%BE%D1%80" // Замените на нужный URL
  },  
            "https://newbornk.com/collections/lifestyle": {
    h1: "LIFESTYLE",
    title: "Дизайнерські речі в Україні | NEWBORN K",
    description: "Дизайнерські речі за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/lifestyle" // Замените на нужный URL
  }, 
  
              "https://newbornk.com/collections/sale": {
    h1: "Знижки на речі",
    title: "речі зі знижкою, купити дизайнерські речі за найкращою ціною | NEWBORN K",
    description: "речі зі знижкою ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/sale" // Замените на нужный URL
  }, 
                "https://newbornk.com/collections/vzuttya": {
    h1: "Брендове жіноче та чоловіче взуття",
    title: "Брендове жіноче та чоловіче взуття, купити дизайнерське взуття в Україні | NEWBORN K",
    description: "Брендове жіноче та чоловіче взуття за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/vzuttya" // Замените на нужный URL
  }, 
                 "https://newbornk.com/collections/accessoires": {
    h1: "Дизайнерські аксесуари",
    title: "Дизайнерські аксесуари, купити аксесуари в Україні | NEWBORN K",
    description: "Дизайнерські аксесуари за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires" // Замените на нужный URL
  }, 

};

// Функция для замены заголовка h1, title, description и rel="canonical" при полном совпадении URL страницы
function replaceMetaTags() {
  var currentURL = window.location.href;
  var metaTags = pageData[currentURL];

  if (metaTags) {
    var h1Element = document.querySelector("h1");
    var titleElement = document.querySelector("title");
    var metaDescriptionElement = document.querySelector('meta[name="description"]');
    var canonicalElement = document.querySelector('link[rel="canonical"]');

    if (h1Element) {
      h1Element.innerText = metaTags.h1;
    }

    if (titleElement) {
      titleElement.innerText = metaTags.title;
    }

    if (metaDescriptionElement) {
      metaDescriptionElement.setAttribute("content", metaTags.description);
    }

    if (canonicalElement) {
      canonicalElement.setAttribute("href", metaTags.canonicalURL);
    }
  }
}

document.addEventListener("DOMContentLoaded", replaceMetaTags);
